python_tdoc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-07 Sun 22:02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - TDoc</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - TDoc</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga29dbc9">Introduction</a></li>
<li><a href="#orgb6df13a">Features</a></li>
<li><a href="#org4cc8593">Syntax</a></li>
<li><a href="#org2ea33c3">Source code</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga29dbc9" class="outline-2">
<h2 id="orga29dbc9">Introduction</h2>
<div class="outline-text-2" id="text-orga29dbc9">
<p>
In order to facilitate the tdoc. related processing, I wrote a simple module using Python, termed <code>tdoc</code>, based on
</p>
<ul class="org-ul">
<li>Builtin modules, <code>os</code>, <code>functools</code>, <code>multiprocessing</code>, <code>argparse</code>; and</li>
<li>3rd party libraries, <code>pandas</code>, <code>pybtex</code>, <code>urllib</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb6df13a" class="outline-2">
<h2 id="orgb6df13a">Features</h2>
<div class="outline-text-2" id="text-orgb6df13a">
<ul class="org-ul">
<li>It takes a tdoc. list file, usually has a <code>xlsx</code> extension name, as input.</li>
<li>It optionally filters the target tdocs. with agenda item, title, and/or author (e.g., company).</li>
<li>It can download tdocs. interested from <a href="https://www.3gpp.org/ftp">3GPP</a> using multithreading (with configurable thread number) to a specified directory.</li>
<li>It can build a database based on the tdocs. after necessary filtering, and export it to a <code>bib</code> file.</li>
</ul>
</div>
</div>
<div id="outline-container-org4cc8593" class="outline-2">
<h2 id="org4cc8593">Syntax</h2>
<div class="outline-text-2" id="text-org4cc8593">
<p>
Its syntax can be listed as follows by run <code>python tdoc.py --help</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh">usage: tdoc.py [-h] [--remote_dir REMOTE_DIR]
               [--output_dir OUTPUT_DIR] [--agenda_item AGENDA]
               [--title TITLE] [--author AUTHOR]
               [--bibtex_file BIBTEX_FILE]
               [--thread_num THREAD_NUM]
               tdoc_list

positional arguments:
  tdoc_list

options:
  -h, --help show this help message and exit
  --remote_dir REMOTE_DIR
  --output_dir OUTPUT_DIR
  --agenda_item AGENDA
  --title TITLE
  --author AUTHOR
  --bibtex_file BIBTEX_FILE
  --thread_num THREAD_NUM
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ea33c3" class="outline-2">
<h2 id="org2ea33c3">Source code</h2>
<div class="outline-text-2" id="text-org2ea33c3">
<div class="org-src-container">
<pre class="src src-python">import os
import pandas as pd
from pybtex.database import BibliographyData, Entry
from urllib.request import urlretrieve
from functools import partial
from multiprocessing import Pool
from argparse import ArgumentParser, Namespace

class Temporary_Document:
    def __init__(self, fn: str, remote_dir: str) -&gt; None:
        """! Constructor
        @param fn File name of the tdoc list, i.e., an MS excel file.
        @param remote_dir Remote storage for tdoc(s)
        """
        self.df = pd.read_excel(fn, usecols=[0, 1, 2, 10, 13], skiprows=1, names=['id', 'title', 'author', 'agenda', 'status'], index_col=0, dtype=str)
        self.df['author'].replace({'.*Qualcomm.*':'QC', \
                                   '.*Nokia.*':'Nokia', \
                                   '.*DOCOMO.*':'DOCOMO', \
                                   '.*Huawei.*':'Huawei', \
                                   '.*ZTE.*':'ZTE', \
                                   '.*InterDigital.*':'InterDigital', \
                                   '.*MediaTek.*':'MTK'}, regex=True, inplace=True)
        self.df = self.df[self.df['status'] == 'available']
        self.remote_dir = remote_dir
    def filter_agenda(self, ai: str) -&gt; None:
        """! Filter the entries using agenda item
        @param ai Agenda item
        """
        self.df = self.df[self.df['agenda'] == ai]
    def filter_title(self, title: str) -&gt; None:
        """! Filter the entries using title
        @param title A substring to match
        """
        self.df = self.df[self.df['title'].str.contains(title, case=False)]
    def filter_author(self, author: str) -&gt; None:
        """! Filter the entries using author (company name)
        @param author Author (company name)
        """
        self.df = self.df[self.df['author'] == author]
    def gen_db(self) -&gt; None:
        """! Build the database based on the entries."""
        self.db = BibliographyData()
        for tdoc in self.df.itertuples():
            print(tdoc.Index)
            self.db.add_entry(tdoc.Index, Entry('article', {'author': tdoc.author, 'title': tdoc.title, 'agenda': tdoc.agenda}))
    def gen_bib(self, fn: str) -&gt; None:
        """! Generate bibtex file for further reference.
        @param fn The name of bibtex file
        """
        self.db.to_file(fn, bib_format='bibtex')
    def download_parallel(self, output_dir: str, thread_num: int) -&gt; None:
        """! Download the entries to a specified directory in a parallel way.
        @param output_dir Directory to store the tdocs
        @param thread_num Thread number
        """
        pfunc = partial(download_tdoc, self.remote_dir, output_dir)
        p = Pool(thread_num)
        p.map(pfunc, self.df.index.tolist())
        p.close()
        p.join()

def download_tdoc(remote_dir: str, local_dir: str, id: str) -&gt; None:
    """! Download a tdoc.
    @param remote_dir Remote directory of the tdoc.
    @param local_dir Local directory for the tdoc.
    @param id Tdoc. number
    """
    fn_remote = os.path.join(remote_dir, f'{id}.zip')
    fn_local = os.path.join(local_dir, f'{id}.zip')
    if os.path.exists(fn_local):
        print(f'{id} exists already, skipping ...')
    else:
        urlretrieve(fn_remote, fn_local)
        print(f'{id} downloaded.')

def main(args: Namespace) -&gt; None:
    """! Main loop
    @args Arguments
    """
    t = Temporary_Document(args.tdoc_list, args.remote_dir)
    if args.agenda is not None:
        t.filter_agenda(args.agenda)
    if args.title is not None:
        t.filter_title(args.title)
    if args.author is not None:
        t.filter_author(args.author)
    t.gen_db()
    if not os.path.exists(args.output_dir):
        os.mkdir(args.output_dir)
    t.gen_bib(os.path.join(args.output_dir, args.bibtex_file))
    t.download_parallel(args.output_dir, args.thread_num)

if __name__ == "__main__":
    p = ArgumentParser()
    p.add_argument('tdoc_list', type=str)
    p.add_argument('--remote_dir', type=str, dest='remote_dir', default=None)
    p.add_argument('--output_dir', type=str, dest='output_dir', default='.')
    p.add_argument('--agenda_item', type=str, dest='agenda', default=None)
    p.add_argument('--title', type=str, dest='title', default=None)
    p.add_argument('--author', type=str, dest='author', default=None)
    p.add_argument('--bibtex_file', type=str, dest='bibtex_file', default='tdoc.bib')
    p.add_argument('--thread_num', type=int, dest='thread_num', default=1)
    main(p.parse_args())
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
